<?php

use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;

class BcsDataSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //

        $raw = '한스모터스,김성일,010-5637-0788,02-451-0788,서울시,강남구,서울시 강남구 일원동624-3,hansmotors12@gmail.com,206-26-40202
강북커먼레일,이시중,010-6711-3736,02-989-4972,서울시,강북구,서울특별시 강북구 수유동 472-207,ausil@naver.com,210-13-51163
보쉬카 노원점,윤진수,010-8701-2005,02-978-3458,서울시,노원구,서울시 노원구 하계동 240-19 ,blueskyme68@hanmail.net,217-24-17629
카서비스 가든,박성덕,010 4445 4588,02 401 5152,서울시,송파구,서울시 송파구 가락2동 193-8,bcsgd@daum.net,215-22-53983
유레카,유성관,010-2758-7202,02-2645-6514,서울시,양천구,서울시 양천구 신정동 1015-3,yousk66@naver.com,121-12-59311
위즈모터스,장동암,010-4187-5000,02-2633-7323,서울시,영등포구,서울시 영등포구 당산동 3가 555-3,wizmotors@hanmail.net,107-87-73843
상봉카센타 ,김홍관,010-3778-7420,02-493-0408,서울시,중랑구,서울특별시 중량구 봉우재로204,khk3642@hanmail.net,216-04-07775
넬리_ 오토브,김정회,010-9864-8001,02-999-6582,서울시,강북구,서울시 강북구 노해로 110-2[수유동],abcxyz@nully.co.kr,130-86-11762
제이제이모터스,박장선,010-3316-6409,032-545-8572,인천시,계양구,인천광역시 계양구 서운동 179,sunjangpark@naver.com,122-35-40487
화이트자동차정비,유명서,010-9170-3500,032-668-3500,경기도,부천시,경기도 부천시 소사구 경인로 10번길 38[송내동],y-yooms@hanmail.net,130-31-32170
글로벌모터스,김진수,010-4669-3005,031-593-8255,경기도,남양주시,경기도 남양주시 화도읍 창현리 190-2,chinmaaa@naver.com,132-24-45300
진모터스 ,조시찬,010-6455-7945,031-868-0982,경기도,동두천시,경기도 동두천시 생연동712-4,jj9080@hanmail.net,127-40-92742
이두희 모터스,이두희,010-6397-1345,031) 871 1346,경기도,의정부시,경기도 의정부시 호원동 309-117,Me0919@hanmail.net,127-15-98287
똠방 자동차 정비,최락훈,010-8515-1576,031-416-9650,경기도,안산시,경기도 안산시 상록구 이동 684-4,ch1576@nate.com,134-26-90066
공룡모터스,배상률,010-8665-5282,031-409-5182,경기도,안산시,경기도 안산시 상록구 본오동 834-8,srbae76@naver.com,134-30-03501
골든모터스,김태경,010-5319-3802,031-445-3202,경기도,안양시,경기도 안양시 만안구 안양6동 508-26,kimttg@naver.com,123-05-49000
동성카센타 ,김봉국,010-8743-2402,031-974-7600,경기도,고양시,경기도 고양시 덕양구 토당동415-4 ,st1010kr@naver.com,128-38-89285
자동차와 사람들 ,김진익,010-3727-8722,031-998-6611,경기도,김포시,경기도 김포시 대곶면 대능리2-13,swcar@naver.com,118-14-68934
보쉬카 능곡점,이휘성,010-5393-9001,031)404-1233,경기도,시흥시,경기도 시흥시 목실길 45 [능곡동],calar1@naver.com,140-10-96180
보쉬카서비스 운정점,정기수,010-4025-2428,031-947-5115,경기도,파주시,경기도 파주시 심학산로423번길 12-4,j5030@hanmail.net,460-17-00364
마이카1004,박정호,010-3798-2410,031 708 8297,경기도,성남시,경기도 성남시 분당구 야탑동 527-4,parkjh002@hanmail.net,129-24-59297
새벽을 여는 사람들,김성구,010-2009-7327,031-321-1952,경기도,용인시,경기도 용인시 처인구 양지면 송문리 508-7,doqlek@hanmail.net,135-13-50238
중앙모터스 ,안수복,010-9010-3657,031-675-3657,경기도,안성시,경기도 안성시 대덕면 내리 330,subokahn@hanmail.net,125-18-78215
그린카 ,강영수,010-9840-0314,031-373-8408,경기도,오산시,경기도 오산시 원동 765-19 ,tank7877@hanmail.net,124-36-23365
대신카크리닉,공용식,010-9054-6900,031-375-9736,경기도,오산시,경기도 오산시 은계동 23 ,kysmmsd@naver.com,124-13-37894
보쉬카 의왕점,정기영,010-3217-0867,031-453-0333,경기도,의왕시,경기도 의왕시 왕곡동 597-2 ,gdmhs@naver.com,114-03-30288
보쉬금호모터스,권혁상,010-9092-9123,031-373-9123,경기도,평택시,경기도 평택시 진위면 진위산단로 53-74,kumhocar1021@naver.com,124-04-43093
드림모터스,김학선,010-9424-5178,031-238-8872,수원시,권선구,수원시 권선구 곡반정동 610-3,cheroke3@paran.com,130-04-40432
수레와 바퀴,민성기,010-6602-6324,031-296-2556,수원시,권선구,수원시 권선구 구운동 907-5 ,m258s@hanmail.net,124-35-32907
한백카서비스,이경현,010-3630-6570,031-8015-1567,경기도,화성시,경기도 화성시 지산1길 18-19,leveme21016@naver.com,124-41-38182
마이스터 아우토,이정우,010-6402-8816,042-826-8819,대전시,유성구,대전시 유성구 궁동 490-18,powerljw@naver.com,314-21-26317
서산보쉬카서비스,진명기,010-8823-4766,041-665-4767,충청남도,서산시,충남 서산시 수석산업로 21,jmkchh@naver.com,316-04-25700
오토리더,윤정욱,010-8766-6800,041-977-5678,충청남도,홍성군,충청남도 홍성군 홍성읍 충절로 1031,yjy756@naver.com,210-78-00057
보쉬카랜드 ,박승규,010-5461-5355,043-272-5355,충청북도,홍성군,충청북도 청주시 흥덕구 직지대로 658,tt21com@naver.co.kr,315-01-30704
군산디젤센터(구 유리카),강병수,010-2958-7228,063-443-3689,전라북도,군산시,전북 군산시 미장동 381-27 ,kbs3689@paran.com,401-14-54706
RPM카서비스,서장원,010-3676-3369,063-452-4607,전라북도,군산시,전북 군산시 개정면 통사리 309-2,rpm4607@nate.com,401-04-27893
스타카 클리닉,김현홍,011-9955-0865,063-467-0865,전라북도,군산시,전북 군산시 요죽안2길 20,khh0865@hanmail.net,402-21-87566
도통점,조지운,010-3697-0576,063-635-7100,전라북도,남원시,전북 남원시 도통동 30-6,boschpro@hanmail.net,407-06-13479
좋은차만들기,홍성수,010-8643-7905,063-636-1342,전라북도,남원시,전북 남원시 월락동 129-90번지,hongss1363@naver.com,407-04-69509
마이카서비스 ,김종연,010-6608-7503,063-263-8676,전라북도,완주군,전북 완주군 삼례읍 석전리 179-2,kim0336@hanmail.net,402-16-96829
친구카센타,전종삼,010-5651-6950,063-857-6950,전라북도,익산시,전북 익산시 신동 767-17,car6950@hanmail.net,403-04-99942
보쉬카 송천점,오정만,010-3684-1874,063-255-7447,전주시,덕진구,전주시 덕진구 2가 송천동 835-3,ojm751205@naver.com,418-05-52835
황조카센타,노재현,010-9028-0388,063-222-0385,전주시,완산구,전주시 완산구 삼청동 삼천천변3길 32-21,nohjeahyun@naver.com,402-49-01562
킹카모터스,문성진,010-3347-4241,062-955-4242,광주시,광산구,광주광역시 광산구 수완동1529,mun-fd@hanmail.net,410-25-77145
보쉬카 수완점,곽정철,010-7421-7700,062-954-6333,광주시,광산구,광주광역시 광산구 장덕동 1419,boschcar@naver.com,410-27-52094
대운모터스,김대운,010-3646-3622,062-956-8869,광주시,광산구,광주광역시 광산구 하남동 644, daewun71@hanmail.net,408-04-17886
성실카서비스,김용복,010-2625-0865,062-671-0865,광주시,서구,광주광역시 서구 금호동 908,25426190@hanmail.net,4100643042
오사카 서비스,최영규,010-5589-0409,062-576-1995,광주시,서구,광주광역시 서구 쌍촌동 965-21,dream3902@naver.com,410-14-38243
보쉬카 상무점,김인성,010-8624-8579,062-383-8579,광주시,서구,광주광역시 서구 천변좌하로 188,boschcar7@naver.com,410-30-86634
금강자동차 (목포),강춘길,010-3631-9871,061-282-7988,전라남도,목포시,전남 목포시 석현동919-4,kcc5488@naver.com,411-22-29024
프로카센타,양종갑,010-6854-0687,061-351-1147,전라남도,영광군,전남 영광군 영광읍 신하76-2,yy0006@hanmail.net,410-13-71769
희봉카센터,고희봉,010-3639-3456,064-758-0644,제주도,제주시,제주특별자치도 제주시 연삼로 112-1 (오라삼동),uio3456@naver.com,850-23-00156
오너라인 ,윤기원,010-3512-7863,053-384-7863,대구시,북구,대구광역시 북구 팔달동 33-3,wgylg@hanmail.net,504-13-08649
OK카프라자,정재형,010-4511-8506,054-972-8153,경상북도,칠곡군,경상북도 칠곡군 왜관읍 왜관리 99-24번지,okcar8506@daum.net,504-04-43232
진주1호점,박현진,010-2534-7060,055-744-2227,경상남도,진주시,경남 진주시 봉곡동 488-1,mp2039@hanmail.net,613-18-43421
경남정비공업사,정용관,010 2064 8572,055-281-0113,경상남도,창원시,경남 창원시 내동 456-15,knmotors@naver.com,609-04-83368
보쉬카 진해중앙점(차앤차샵),김종국,010-4100-3735,055-551-9577,경상남도,창원시,경남 창원시 진해구 이동 633-7,babilol@hanmail.net,606-30-84315
보쉬사천서비스센터,김진근,010-4845-2662,055-855-5522,경상남도,사천시,경상남도 사천시 사남면 공단1로 82,tirezone1st@naver.com,428-61-00188
㈜미음보쉬정비,박성종,010-3581-7686,051-714-0117,부산시,강서구,부산광역시 강서구 구랑동 1162-2,psj7686@hanmail.net,603-81-86505
JK모터스,노정규,010-8558-8213,051-896-8214,부산시,부산진구,부산광역시 부산진구 가야2동 644-4 ,kue12345@hanmail.net,605-25-17764
하구언카 서비스,박훈식,010-3855-5929,051-205-0799,부산시,사하구,부산광역시 사하구 하단동 605-37,psj768601@naver.com,603-03-36803
부창자동차공업사 ,배상구,010-9226-7702,051-754-0770,부산시,수영구,부산광역시 수영구 광안2동 190-8,bae0770@naver.com,617-15-51223
동부산 부성자동차공업사,김재훈,010 9798 5019,051-543-1835,부산시,해운대구,부산광역시 해운대구 반송2동 284,hun5019@naver.com,618-23-67553
보쉬카 강릉점,김성우,010-7123-5533,033-642-7501,강원도,강릉시,강원도 강릉시 내곡동 419-7,w2026@hanmail.net,226-09-55018
보쉬카원주점,김종영,010-9158-0660,033-732-0889,강원도,원주시,강원도 원주시 태장동 698-14,xchicken@hanmail.net,224-09-85874
보쉬카 호반점,이연주,010-8798-3311,033-242-3314,강원도,춘천시,강원도 춘천시 퇴계동 381-37,lyj3311@hanmail.net,221-03-48956';

        $rows = str_getcsv($raw, "\n");
        $rows_list = [];

        foreach ($rows as $key => $row) {
            $csv = str_getcsv($row);
            $rows_list[$key] = $csv;
        }

        $bcs_raw_data = [];

        foreach($rows_list as $key => $row){
            $k = [
                'users' => ['password' => bcrypt('bcs1234'), 'status_cd' => 1],
                'user_extras' => []];
            foreach ($row as $i => $low) {
                switch($i){
                    case 0:
                        $k['users']['name'] = $low;break;
                    case 1:
                        $k['user_extras']['ceo_name'] = $low;break;
                    case 2:
                        $k['users']['mobile'] = $low;
                        $k['user_extras']['ceo_mobile'] = $low;
                        break;
                    case 3:
                        $k['user_extras']['phone'] = $low;break;
                    case 4:
                        $k['user_extras']['area'] = $low;break;
                    case 5:
                        $k['user_extras']['section'] = $low;break;
                    case 6:
                        $k['user_extras']['address'] = $low;break;
                    case 7:
                        $k['users']['email'] = $low;break;
                    case 8:
                        $k['user_extras']['registration_number'] = $low;break;
                }
            }
            $bcs_raw_data[$key] = $k;
        }


        try{
            DB::beginTransaction();

            foreach ($bcs_raw_data as $k => $bcs_data){


                $user_id = DB::table('users')->insertGetId($bcs_data['users']);
                DB::table('role_user')->insert([
                    'user_id' => $user_id,
                    'role_id' => 4
                ]);

                DB::table('role_user')->insert([
                    'user_id' => $user_id,
                    'role_id' => 5
                ]);

                $bcs_data['user_extras']['users_id'] = $user_id;
                DB::table('user_extras')->insert($bcs_data['user_extras']);

                echo $bcs_data['users']['name'].": ".$user_id.PHP_EOL;
            }

            DB::commit();

        }catch (\Exception $e){
            echo "Exception Occured: " . $e->getMessage().PHP_EOL;
            DB::rollback();
        }




    }
}
