<?php

return [
        'title' => '회원가입',
        'desc' => '차검사 회원가입을 진행합니다. 간단한 입력만으로 차검사의 회원이 될 수 있습니다.',
        'email' => '이메일',
        'name' => '이름',
        'password' => '비밀번호',
        'password_confirmation' => '비밀번호 확인',


        'email-title' => '안녕하세요! 중고차 인증 서비스 차검사입니다.',
        'email-intro' => '차검사 회원이 되신것을 환영합니다. 차검사 서비스를 이용하시려면 아래의 "이메일 인증완료"를 클릭해 주십시오.',
        'email-button' => '이메일 인증완료',


        'access_deny' => '이용하실 수 없습니다. 이메일 인증이 완료되었는지 사용가능한 계정인지 확인하세요.' ,

        'verify' => [

                'title' => '이메일 인증메일 발송',
                'send_message' => '이메일 인증메일이 발송되었습니다.<br/>입력하신 이메일을 확인하여 회원가입을 완료하세요.' .
                '<br>이메일 인증메일을 다시 발송하시려면 <a href="' . url('resend') . '" class="">클릭하세요.</a>.',

//                'send_fail_message'     => '인증메일 발송이 실패했습니다.' +
//                '<br>이메일 인증메일을 다시 발송하시려면 <a href="' . url('resend') . '" class="">클릭하세요.</a>.',

                'success_message' => '이메일 인증이 완료되었습니다. 로그인 하실 수 있습니다.',
                'fail_message' => '이메일 인증이 실패했습니다. 다시 시도해주세요.',
                'expire_message' => '인증이 만료되었습니다. 새로운 인증을 진행해 주세요.',


                'resend_message' => '이메일 인증메일을 다시 발송할 수 있습니다.'.
                '<br>하지만 먼저 입력하신 이메일이 정확한지 또는 받은 이메일이 스팸으로 분류되지 않았는지 다시 확인해보시기 바랍니다.'.
                 '<br>계속해서 이런 수신확인이 되지 않을 경우 관리자에게 직접 문의하실 수 있습니다. <a href="' . route('contact.create') . '" class="">클릭하세요.</a>.',

                'resent_message' => '이메일 인증메일이 재발송되었습니다.',



        ],







        'check_error_email' => '이메일을 잘못입력하셧습니다. 다시 확인 후 입력하세요.',
        'require_login' => '로그인이 필요한 서비스입니다.',

        'warning' => 'Attention',
        'warning-name' => '30 characters maximum',
        'warning-password' => 'At least 8 characters',
        'ok' => '가입이 완료되었습니다.',
        'error' => 'These credentials do not match our records.'

















        // 'email-title' => '안녕하세요! 중고차 인증 서비스 차검사입니다.',
        // //    'email-intro' => '차검사 서비스 회원이 되신것을 환영합니다. \n차검사 서비스를 이용하시려면 아래의 이메일인증 버튼을 클릭해 주세요.',
        // 'email-intro' => '차검사 회원이 되신것을 환영합니다. 차검사 서비스를 이용하시려면 아래의 "이메일 인증완료"를 클릭해 주십시오.',
        // 'email-button' => '이메일 인증완료',
        // 'message' => '이메일 인증메일이 발송되었습니다. 입력하신 이메일을 확인하여 회원가입을 완료하세요.',
        // 'success' => '이메일 인증이 완료되었습니다.! 로그인 하실 수 있습니다.',
        // 'again' => '차검사 서비스 이용을 위해 먼저 이메일 인증이 완료되어야 합니다.' .
        // '<br>만약, 인증메일을 받지 못했다면 입력하신 이메일이 정확한지 또는 받은 이메일이 스팸으로 분류되지 않았는지 확인해보세요.' .
        // '<br>새로운 인증메일을 발송하시려면 <a href="' . url('resend') . '" class="alert-link">클릭하세요.</a>.',
        // 'resend' => '이메일 인증메일이 재발송되었습니다. 입력하신 이메일을 확인하세요.',
        // 'check_error_email' => '이메일을 잘못입력하셧습니다. 다시 확인 후 입력하세요.',
        // 'require_login' => '로그인이 필요한 서비스입니다.'
];
