<?php

return [
    'email-title' => '차검사 회원가입 이메일 인증입니다.',
    'email-intro' => '차검사 서비스 회원이 되신것을 환영합니다.<br>차검사 서비스를 이용하시려면 아래의 이메일인증 버튼을 클릭해 주세요.',
    'email-button' => '이메일 인증완료',
    'message' => '이메일 인증메일이 발송되었습니다. 입력하신 이메일을 확인하여 회원가입을 완료하세요.',
    'success' => '이메일 인증이 완료되었습니다.! 로그인 하실 수 있습니다.',
    'again' => '차검사 서비스 이용을 위해 먼저 이메일 인증이 완료되어야 합니다.' .
    '<br>만약, 인증메일을 받지 못했다면 입력하신 이메일이 정확한지 또는 받은 이메일이 스팸으로 분류되지 않았는지 확인해보세요.' .
    '<br>새로운 인증메일을 발송하시려면 <a href="' . url('resend') . '" class="alert-link">클릭하세요.</a>.',
    'resend' => '이메일 인증메일이 재발송되었습니다. 입력하신 이메일을 확인하세요.',
    'check_error_email' => '이메일을 잘못입력하셧습니다. 다시 확인 후 입력하세요.',
    'require_login' => '로그인이 필요한 서비스입니다.'
];
