
<dl class="document-information">
        <dt><span>약관</span></dt>
        <dd>
                <div class="agreement">
                        <h6>1. 보증범위</h6>
                        <div class="description">가입 자동차를 제작사에서 교부한 취급설명서의 점검 및 정비주기와 사용지침에 따라 정상적으로 관리사용한 상태에서 상기 보증기간내에  자동차의 엔진, 트랜스미션, 조향시스템, 브레이크시스템, 냉난방공조기 등 부품에 대한 결함에 의한 고장임이 밝혀진 경우 해당부품을 무상으로 수리하여 드립니다.</div>

                        <h6>2. 보증기간</h6>
                        <div class="description">주행거리에 상관없이 가입하신 상품의 기간(6개월, 1년) 내에 수리 접수 하신 경우에 해당됩니다.</div>

                        <h6>3. 보증한도</h6>
                        <div class="description">최대 200만원까지 보상되며,  수리당 자기부담금 10만원과 한도를 초과하는 수리비용은 가입자가 직접 부담하셔야 합니다.</div>

                        <h6>4. 보증범위 및 제외항목</h6>
                        <div class="description">
                                <div class="document-information-info ">
                                        <table>
                                                <colgroup>
                                                        <col width="10%" />
                                                        <col width="10%" />
                                                        <col width="40%" />
                                                        <col width="40%" />
                                                </colgroup>
                                                <tr>
                                                        <th colspan="2">보장담보</th>
                                                        <th>서비스 대상부품</th>
                                                        <th>서비스 제외부품</th>
                                                </tr>
                                                <tr>
                                                        <td rowspan="2" class="text-center">엔진</td>
                                                        <td class="text-center">주요부품</td>
                                                        <td>- 실린더헤드와그내부부품.실린더블록과그내부부품및그구성부품(커넥팅로드,오 일팬, 크랭크축, 피스톤 등), 크랭크 샤프트플리, 오일펌프, 워터펌프, 워터펌프플리, 캠샤 프트, 로커암 샤프트, 로커암커버, 서모스 텟 및 가스켓, 흡기밸브, 배기밸브, 배기매니폴 드, 플라이 휠, 엔진오일쿨러 및 각종 오일 제어 밸브, 타이밍벨트체인, 각종 엔진내부 가 스켓 및 씰류 등</td>
                                                        <td rowspan="7">
                                                                - 엔진 주변장치 : 스로틀바디, 소음기, 연료탱크, 발전기, 시동모터, 엔진배선류, 저항&센서 스위 치, 엔진마운팅, 배전기, 쿨런트파이프, 레지스터, 써지탱크, 인덕션밸브, 호스류<br/>
                                                                - 변속기 주변장치 : 변속기조작장치, 변속기부착 전장품, 변속기마운팅, 스피드미터드리븐기어, 인풋&아웃풋센서, 변속기오일쿨러, 마스터실린더, 릴리스실린더, 릴리스포크, 릴리스베어링, 릴리스샤프트컴플리트, 유압라인/피팅/호스<br/>
                                                                - 추진축 주변장치 : 휠 허브, 너클, 리어액슬캐리어, 볼 조인트, 허브 베이링<br/>
                                                                - 소모성 부품*<br/>
                                                                - 트림류**<br/>
                                                                - 정상적인 차량관리 항목***<br/>
                                                                - 하이브리드 부품<br/>
                                                                - 배출가스관련부품-외부충격으로인한고장<br/>
                                                                - 누수<br/>
                                                                - 고장이아닌부품의단순부식,변색,헐거워짐,벗겨짐등<br/>
                                                                - 서비스대상부품이외의모든부품<br/>
                                                                * 소모성 부품 타이밍벨트, 팬벨트 등 벨트류 일체, 엔진오일, 브레이크오일, 리어액슬오일 등 오 일류 일체, 엔진오일필터, 연료필터, 에어컨 필터(더스트 필터) 등 필터류 일체, 스 파크 플러그, 글 로우 플러그 등 플러그류 일체, 퓨즈류, 벌브(램프)류, 고압케이블, 배터리, 에어클리너, 브레이크 패드, 라이닝슈, 냉각수 에어컨가스, 와이퍼블레이 드 등<br/>
                                                                ** 트림류 휠, 휠커버, 브레이크 드럼& 디스크, 웨더스트립, 도어몰딩류, 판금, 범퍼, 차체외 장 일 체(판넬포함), 도어아웃사이드 핸들, 프론트 & 리어 시트, 헤드레스트, 프런 트 & 리어 시트트랙(레 일), 플로어카펫, 매트, 유리일체, 등속조인트부트 등<br/>
                                                                *** 정상적인 차량 관리 튠업, 듀티 조정, 휠발란스, 휠얼라이어먼트, 타이어, 타이어위치교환 등
                                                        </td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center">일반부품</td>
                                                        <td>- ECU, 라디에이터, 팬, 팬모터</td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center" rowspan="2">미션</td>
                                                        <td class="text-center">주요 부품</td>
                                                        <td>- 변속기와 그 내부부품(유성기어, 킥다운스위치, 리어클러치, 엔드클러치, 원웨이클러치, 쏠레노이드 밸브, 펄스제너레이터, 트랜스퍼 케이스 등), 토크컨버터, 변속기 내부 가스켓 및 오일씰류 등 - 추진축과 관련 부품, 등속 조인트(단, 고무 부트는 제외), 드라이브 플레 이트, 차동기어, 변속기 내부 가스켓 및 씰류 등 - 차동장치와 액슬 하우징, 액슬 축, 차축 내부 개스킷 및 오일 씰류</td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center">일반부품</td>
                                                        <td>- TCU, 미션 라디에이터</td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center">제동장치</td>
                                                        <td class="text-center">일반부품</td>
                                                        <td>- 레이크마스터실린더, 브레이크 부스터, 프로포셔닝밸브, ABS하이드로 닉 유니트, 휠실린 더, 휠스피드센서, 브레이크 캘리퍼, 백플레이트, 리턴스 프링, 유압라인, 호스 등</td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center">조향장치</td>
                                                        <td class="text-center">일반부품</td>
                                                        <td>- 스티어링 기어 링키지, 스티어링 컬럼 샤프트, 유니버셜 조인트, 파워랙, 피니언 부품, 타 이로드엔드, 파워스티어링 오일 펌프, 파워스티어링 리저 브, 스티어링 휠, 스티어링 리모 트 컨럴, 파워호스 / EPS센서, 등</td>
                                                </tr>
                                                <tr>
                                                        <td class="text-center">냉, 난방 장치</td>
                                                        <td class="text-center">일반부품</td>
                                                        <td>- 에어컨 컴프레셔 & 풀리, 에어컨파이프&호스류, 에어컨콘덴서, 이베퍼 레이터, 리시버탱 크, 익스팬션밸브, 히비터스위치, 전동식 파워스티어링, 히터모터, 히터팬, 히터컨트롤유 니트, 히터코어 & 서미스터, 모드액추어에 이터, 워터템퍼레이터센서, 블로우모터 등</td>
                                                </tr>

                                        </table>
                                </div>
                                <small>※ 긴급출동 및 견인, 렌터카 서비스는 본 보증상품에는 제공되지 않습니다.</small>
                        </div>

                        <h6>5. 부품 자체결함으로 인한 사고의 책임한도</h6>
                        <div class="description">부품자체의 결함으로 인하여 발생한 사고로 입은 손해는 부품 교환 이외의 어더한 것에 대해서도 폐사는 책임을 지지 않습니다.</div>

                        <h6>6. 보증수리</h6>
                        <div class="description">
                                1)본 보증서는 (주)짐브러스 날인이 있는 것에 한하여 유효하며, 차량정보(차량번호, 차대번호 등)을 기준으로 유효함을 확인합니다.<br/>
                                2)보증수리네트워크는 차검사가 지정한 네크워크에서만 가능합니다.<br/>
                                <div class="document-information-info text-center">
                                        <table>
                                                <colgroup>
                                                        <col width="20%" />
                                                        <col width="20%" />
                                                        <col width="20%" />
                                                        <col width="20%" />
                                                        <col width="20%" />
                                                </colgroup>
                                                <tr>
                                                        <th>수리네트워크</th>
                                                        <td>블루핸즈</td>
                                                        <td>오토큐</td>
                                                        <td>르노삼성자동차</td>
                                                        <td>보쉬카서비스</td>
                                                </tr>
                                                <tr>
                                                        <th>수리가능차량</th>
                                                        <td>현대자동차</td>
                                                        <td>기아자동차</td>
                                                        <td>르노삼성자동차</td>
                                                        <td>쌍용,쉐보레,수입차</td>
                                                </tr>
                                                <tr>
                                                        <th>수리점규모(국내)</th>
                                                        <td>1,370개</td>
                                                        <td>824개</td>
                                                        <td>455개</td>
                                                        <td>300여개</td>
                                                </tr>

                                        </table>
                                </div>
                                3)고객이 보증수리를 받고자 하는 경우에는 차검사 콜센터에 전화를 통해 접수하시고 안내에 따라야 합니다.
                        </div>

                        <h6>7. 보증계승</h6>
                        <div class="description">상기 보증기간에 차량의 매매 등으로 인하여 소유자가 변경되어도 보증은 계승됩니다.</div>

                        <h6>8. 제조사 보증기간 중복시</h6>
                        <div class="description">제조사 보증기간이 남아있는 경우, 제조사 보증기간 만료 후 보증기간이 적용되며, 서비스 가입일부터 6개월/12개월 중 가입한 상품별로 적용됩니다.</div>

                        <h6>9. 가입제외</h6>
                        <div class="description">
                                1)전기차, 영업용, 특수차량(앰블러스, 통학버스, 스포츠카 등), 차량가액 2억원 이상의 차량은 가입이 불가능합니다.<br/>
                                2)차검사 진단 시 차량성능에 문제가 있는 차량에 대해 가입을 거절할 수 있습니다.<br/>
                                3)16인승 이상, 1.4톤 이상 화물차는 가입이 불가능합니다.
                        </div>

                </div>
        </dd>
</dl>
