<div class='term_title'>
    카검사 관련 제반 서비스의 이용과 관련하여 필요한 사항을 규정합니다.			
</div>
<div class='term_cont'>
    <div>
        <strong>1조 (목적)</strong>
        이 약관은 (주)진브러스가 운영하는 카검사 웹사이트(http://www.CARGUMSA.com, 이하 "카검사"라 한다)에서 제공하는 인터넷 관련 서비스 및 기타 부대서비스를 이용함에 있어 
    </div>

    <div>
        <strong>2조 (정의)</strong>
        <ol>
            <li>"카검사"란 (주)진브러스가 운영하는 가상의 사업장(http://www.CARGUMSA.com)을 말하며, 아울러 가상의 사업장을 운영하는 사업자의 의미로도 사용합니다.</li>
            <li>"서비스"란 "카검사"가 제공하는 재화의 공급 및 용역이행을 말합니다.</li>
            <li>"이용자"란 "카검사"에 접속하여 이 약관에 따라 "카검사"가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
            <li>"회원"이라 함은 "카검사"에 개인정보를 제공하여 회원등록을 한 자로서, "카검사"의 정보를 지속적으로 제공받으며, "카검사"가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.</li>
            <li>"비회원"이라 함은 회원에 가입하지 않고 "카검사"가 제공하는 서비스를 이용하는 자를 말합니다.</li>
            <li>"쿠폰"이라 함은 회원에게 "카검사"에서 제공되는 유료 "서비스" 결제 시 일정금액 또는 일정비율을 할인 받을 수 있는 사이버 쿠폰을 말합니다.</li>
            <li>"포인트" 라 함은 회원이 "카검사" 에서 제공되는 유료 "서비스" 결제 시 현금처럼 사용할 수 있는 "카검사" 전용의 사이버 화폐를 말합니다.</li>
        </ol>
    </div>

    <div>
        <strong>3조 (약관의 명시와 개정)</strong>
        <ol>
            <li>"카검사"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 연락처(전화, 팩스, 전자우편 주소등) 등을 이용자가 알 수 있도록 카검사의 초기화면에 게시합니다.</li>
            <li>"카검사"는 “전자상거래등에서의소비자보호에관한법률”, "약관의규제에관한법률", "전자문서및전자거래기본법", "전자서명법", "정보통신망이용촉진및정보보호등에관한법률", "방문판매등에관한법률", "소비자기본법" 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
            <li>"카검사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 카검사의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.</li>
            <li>"카검사"가 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 "카검사"에 송신하여 "카검사"의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.</li>
            <li>이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 "전자상거래등에서의소비자보호지침" 및 관계법령 또는 상관례에 따릅니다.</li>
        </ol>
    </div>
</div>